app/controllers/articles_controller.rb

	def create
    	@article = Article.new(article_params)
    	@article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aqsd"], ["body", "asd"], ["created_at", 2016-09-22 08:41:21 UTC], ["updated_at", 2016-09-22 08:41:21 UTC]]

	def update
	  @article = Article.find(params[:id])
	  @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "beast.png"], ["image_content_type", "image/png"], ["image_file_size", 27720], ["image_updated_at", 2016-09-23 08:17:08 UTC], ["updated_at", 2016-09-23 08:17:08 UTC], ["id", 5]]